{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"content":"<|endoftext|>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":1,"content":"<|user|>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":2,"content":"<|assistant|>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":3,"content":"<|system|>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":4,"content":"<think>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":5,"content":"</think>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true}],"normalizer":{"type":"ByteLevel"},"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true,"use_regex":true},"post_processor":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true,"use_regex":true},"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true,"use_regex":true},"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"byte_fallback":false,"ignore_merges":false,"vocab":{"<|endoftext|>":0,"<|user|>":1,"<|assistant|>":2,"<|system|>":3,"<think>":4,"</think>":5,"!":6,".":7,"/":8,"<":9,">":10,"H":11,"T":12,"a":13,"d":14,"e":15,"h":16,"i":17,"k":18,"l":19,"n":20,"o":21,"r":22,"s":23,"t":24,"w":25,"Ä":26,"Ġ":27,"Ĭ":28,"ł":29,"Äł":30,"hi":31,"nk":32,"sÄł":33,"thi":34,"think":35},"merges":[["Ä","ł"],["h","i"],["n","k"],["s","Äł"],["t","hi"],["thi","nk"]]}}